In [ ]:
Write a solution to find the nth highest salary from the Employee table. If there is no nth highest salary, return null.

The result format is in the following example.

 

Example 1:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
n = 2
Output: 
+------------------------+
| getNthHighestSalary(2) |
+------------------------+
| 200                    |
+------------------------+
Example 2:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
n = 2
Output: 
+------------------------+
| getNthHighestSalary(2) |
+------------------------+
| null                   |
+------------------------+

In [12]:
import pandas as pd
data = [[1, 100], [2, 200], [3, 300],[4,400],[5,100]]
employee = pd.DataFrame(data, columns=['Id', 'salary']).astype({'Id':'Int64', 'salary':'Int64'})

In [13]:
employee

   Id  salary
0   1     100
1   2     200
2   3     300
3   4     400
4   5     100

In [27]:
employee = employee.sort_values(by = "salary", ascending=False)
employee

   Id  salary
3   4     400
2   3     300
1   2     200
0   1     100

In [36]:
N = int(input())
employee[employee.salary == employee.salary.iloc[N-1]].rename(columns = {"salary":"Nthhighest Salary("+str(N)+")"})

2

   Id  Nthhighest Salary(2)
2   3                   300

In [38]:
pd.DataFrame(data = {"Nthhighest Salary("+str(N)+")":[None]})

  Nthhighest Salary(2)
0                 None

In [44]:
### Solution 1: iloc
def n_highest_func(employee):
    N = int(input())
    employee = employee.drop_duplicates(subset = ["salary"]).reset_index(drop=True)
    employee = employee.sort_values(by = "salary", ascending=False)
    if N >= len(employee) or N<=0:
        return pd.DataFrame(data = {"Nthhighest Salary)"+str(N)+")":[None]})
    else:
        return employee[employee.salary == employee.salary.iloc[N-1]].rename(columns = {"salary":"Nthhighest Salary("+str(N)+")"})        
    
n_highest_func(employee)

2

   Id  Nthhighest Salary(2)
2   3                   300

In [66]:
### Solution 2: Using iloc
def n_highest_func(employee):
    N = int(input())
    sal_unique = employee.salary.drop_duplicates()
    sorted_sal = sal_unique.sort_values(ascending = False)
    highest = sorted_sal.iloc[N-1]
    
    if N>len(employee) or N<=0:
        return pd.DataFrame(data = {"Nthhighest Salary("+str(N)+")":[None]})
    else:
        return pd.DataFrame({'nhighest Salary('+str(N)+')':[highest]})
    
    
n_highest_func(employee)

3

   nhighest Salary(3)
0                 200

In [78]:
#### 3rd solution using nlargest

def n_highest_func(employee):
    employee = employee.drop_duplicates(subset = ["salary"]).reset_index(drop=True)
    if N> len(employee) or N<=0:
        return pd.DataFrame(data = {"Nthhighest Salary("+str(N)+")":[None]})
    return employee[employee.salary == employee.salary.nlargest(N).iloc[-1]][["salary"]].rename(columns = {"salary": "Nthhighest Salary("+str(N)+")"})

n_highest_func(employee)

   Nthhighest Salary(2)
2                   300